Tekla.Structures.Drawing.CannotSetAttributeForPluginException
The CannotSetAttributeForPluginException class defines the exception that is
thrown when Plugin.SetAttribute is called but the attribute cannot be set.

Tekla.Structures.Drawing.CannotSetAttributeForPluginException.#ctor
Creates a new CannotSetAttributeForPluginException instance.

Tekla.Structures.Drawing.CannotSetAttributeForPluginException.#ctor(System.String)
Creates a new CannotSetAttributeForPluginException instance.
Description: The additional description.

Tekla.Structures.Drawing.CannotSetAttributeForPluginException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.